1) поменять местами первый и последний элемент списка(СДЕЛАНО)
2) вставить элем. в заданное место списка (СДЕЛАНО)
(СДЕЛАНО)
3) продублировать каждый элемент списка(СДЕЛАНО)
4) разбить списки на два списка с заданной величиной N и M (длинна изначального списка N + M)(СДЕЛАНО)
5) убрать каждый N-ый элемент в списке
*6) расставить знаки так, чтобы получилось уравнение
7) замена чисел на слова(СДЕЛАНО)
8) по формуле трапеций посчитать интеграл от 0 до 2pi по sin (x) (СДЕЛАНО)
9) найти обратную матрицу
